grevaillot/svd_tools/headers/STM32F3x4/hrtim_timc.h
/** @defgroup hrtim_timc_percr PERCR Timerx Period Register
@{*/


#define HRTIM_TIMC_PERCR_PERx_SHIFT		0
#define HRTIM_TIMC_PERCR_PERx_MASK		0xffff
/** @defgroup hrtim_timc_percr_perx PERx Timerx Period value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_repcr REPCR Timerx Repetition Register
@{*/


#define HRTIM_TIMC_REPCR_REPx_SHIFT		0
#define HRTIM_TIMC_REPCR_REPx_MASK		0xff
/** @defgroup hrtim_timc_repcr_repx REPx Timerx Repetition counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp1cr CMP1CR Timerx Compare 1 Register
@{*/


#define HRTIM_TIMC_CMP1CR_CMP1x_SHIFT		0
#define HRTIM_TIMC_CMP1CR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timc_cmp1cr_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp1ccr CMP1CCR Timerx Compare 1 Compound Register
@{*/


#define HRTIM_TIMC_CMP1CCR_REPx_SHIFT		16
#define HRTIM_TIMC_CMP1CCR_REPx_MASK		0xff
/** @defgroup hrtim_timc_cmp1ccr_repx REPx Timerx Repetition value (aliased from HRTIM_REPx register)
@{*/
/**@}*/


#define HRTIM_TIMC_CMP1CCR_CMP1x_SHIFT		0
#define HRTIM_TIMC_CMP1CCR_CMP1x_MASK		0xffff
/** @defgroup hrtim_timc_cmp1ccr_cmp1x CMP1x Timerx Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp2cr CMP2CR Timerx Compare 2 Register
@{*/


#define HRTIM_TIMC_CMP2CR_CMP2x_SHIFT		0
#define HRTIM_TIMC_CMP2CR_CMP2x_MASK		0xffff
/** @defgroup hrtim_timc_cmp2cr_cmp2x CMP2x Timerx Compare 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp3cr CMP3CR Timerx Compare 3 Register
@{*/


#define HRTIM_TIMC_CMP3CR_CMP3x_SHIFT		0
#define HRTIM_TIMC_CMP3CR_CMP3x_MASK		0xffff
/** @defgroup hrtim_timc_cmp3cr_cmp3x CMP3x Timerx Compare 3 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cmp4cr CMP4CR Timerx Compare 4 Register
@{*/


#define HRTIM_TIMC_CMP4CR_CMP4x_SHIFT		0
#define HRTIM_TIMC_CMP4CR_CMP4x_MASK		0xffff
/** @defgroup hrtim_timc_cmp4cr_cmp4x CMP4x Timerx Compare 4 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cpt1cr CPT1CR Timerx Capture 1 Register
@{*/


#define HRTIM_TIMC_CPT1CR_CPT1x_SHIFT		0
#define HRTIM_TIMC_CPT1CR_CPT1x_MASK		0xffff
/** @defgroup hrtim_timc_cpt1cr_cpt1x CPT1x Timerx Capture 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_cpt2cr CPT2CR Timerx Capture 2 Register
@{*/


#define HRTIM_TIMC_CPT2CR_CPT2x_SHIFT		0
#define HRTIM_TIMC_CPT2CR_CPT2x_MASK		0xffff
/** @defgroup hrtim_timc_cpt2cr_cpt2x CPT2x Timerx Capture 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_dtcr DTCR Timerx Deadtime Register
@{*/

/** HRTIM_TIMC_DTCR_DTFLKx Deadtime Falling Lock **/
#define HRTIM_TIMC_DTCR_DTFLKx		(1 << 31)
/** HRTIM_TIMC_DTCR_DTFSLKx Deadtime Falling Sign Lock **/
#define HRTIM_TIMC_DTCR_DTFSLKx		(1 << 30)
/** HRTIM_TIMC_DTCR_SDTFx Sign Deadtime Falling value **/
#define HRTIM_TIMC_DTCR_SDTFx		(1 << 25)

#define HRTIM_TIMC_DTCR_DTFx_SHIFT		16
#define HRTIM_TIMC_DTCR_DTFx_MASK		0x1ff
/** @defgroup hrtim_timc_dtcr_dtfx DTFx Deadtime Falling value
@{*/
/**@}*/

/** HRTIM_TIMC_DTCR_DTRLKx Deadtime Rising Lock **/
#define HRTIM_TIMC_DTCR_DTRLKx		(1 << 15)
/** HRTIM_TIMC_DTCR_DTRSLKx Deadtime Rising Sign Lock **/
#define HRTIM_TIMC_DTCR_DTRSLKx		(1 << 14)

#define HRTIM_TIMC_DTCR_DTPRSC_SHIFT		10
#define HRTIM_TIMC_DTCR_DTPRSC_MASK		0x07
/** @defgroup hrtim_timc_dtcr_dtprsc DTPRSC Deadtime Prescaler
@{*/
/**@}*/

/** HRTIM_TIMC_DTCR_SDTRx Sign Deadtime Rising value **/
#define HRTIM_TIMC_DTCR_SDTRx		(1 << 9)

#define HRTIM_TIMC_DTCR_DTRx_SHIFT		0
#define HRTIM_TIMC_DTCR_DTRx_MASK		0x1ff
/** @defgroup hrtim_timc_dtcr_dtrx DTRx Deadtime Rising value
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_timc_setc1r SETC1R Timerx Output1 Set Register
@{*/

/** HRTIM_TIMC_SETC1R_UPDATE Registers update (transfer preload to active) **/
#define HRTIM_TIMC_SETC1R_UPDATE		(1 << 31)
/** HRTIM_TIMC_SETC1R_EXTEVNT10 External Event 10 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMC_SETC1R_EXTEVNT9 External Event 9 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMC_SETC1R_EXTEVNT8 External Event 8 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMC_SETC1R_EXTEVNT7 External Event 7 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMC_SETC1R_EXTEVNT6 External Event 6 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMC_SETC1R_EXTEVNT5 External Event 5 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMC_SETC1R_EXTEVNT4 External Event 4 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMC_SETC1R_EXTEVNT3 External Event 3 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMC_SETC1R_EXTEVNT2 External Event 2 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMC_SETC1R_EXTEVNT1 External Event 1 **/
#define HRTIM_TIMC_SETC1R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMC_SETC1R_TIMEVNT9 Timer Event 9 **/
#define HRTIM_TIMC_SETC1R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMC_SETC1R_TIMEVNT8 Timer Event 8 **/
#define HRTIM_TIMC_SETC1R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMC_SETC1R_TIMEVNT7 Timer Event 7 **/
#define HRTIM_TIMC_SETC1R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMC_SETC1R_TIMEVNT6 Timer Event 6 **/
#define HRTIM_TIMC_SETC1R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMC_SETC1R_TIMEVNT5 Timer Event 5 **/
#define HRTIM_TIMC_SETC1R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMC_SETC1R_TIMEVNT4 Timer Event 4 **/
#define HRTIM_TIMC_SETC1R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMC_SETC1R_TIMEVNT3 Timer Event 3 **/
#define HRTIM_TIMC_SETC1R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMC_SETC1R_TIMEVNT2 Timer Event 2 **/
#define HRTIM_TIMC_SETC1R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMC_SETC1R_TIMEVNT1 Timer Event 1 **/
#define HRTIM_TIMC_SETC1R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMC_SETC1R_MSTCMP4 Master Compare 4 **/
#define HRTIM_TIMC_SETC1R_MSTCMP4		(1 << 11)
/** HRTIM_TIMC_SETC1R_MSTCMP3 Master Compare 3 **/
#define HRTIM_TIMC_SETC1R_MSTCMP3		(1 << 10)
/** HRTIM_TIMC_SETC1R_MSTCMP2 Master Compare 2 **/
#define HRTIM_TIMC_SETC1R_MSTCMP2		(1 << 9)
/** HRTIM_TIMC_SETC1R_MSTCMP1 Master Compare 1 **/
#define HRTIM_TIMC_SETC1R_MSTCMP1		(1 << 8)
/** HRTIM_TIMC_SETC1R_MSTPER Master Period **/
#define HRTIM_TIMC_SETC1R_MSTPER		(1 << 7)
/** HRTIM_TIMC_SETC1R_CMP4 Timer A compare 4 **/
#define HRTIM_TIMC_SETC1R_CMP4		(1 << 6)
/** HRTIM_TIMC_SETC1R_CMP3 Timer A compare 3 **/
#define HRTIM_TIMC_SETC1R_CMP3		(1 << 5)
/** HRTIM_TIMC_SETC1R_CMP2 Timer A compare 2 **/
#define HRTIM_TIMC_SETC1R_CMP2		(1 << 4)
/** HRTIM_TIMC_SETC1R_CMP1 Timer A compare 1 **/
#define HRTIM_TIMC_SETC1R_CMP1		(1 << 3)
/** HRTIM_TIMC_SETC1R_PER Timer A Period **/
#define HRTIM_TIMC_SETC1R_PER		(1 << 2)
/** HRTIM_TIMC_SETC1R_RESYNC Timer A resynchronizaton **/
#define HRTIM_TIMC_SETC1R_RESYNC		(1 << 1)
/** HRTIM_TIMC_SETC1R_SST Software Set trigger **/
#define HRTIM_TIMC_SETC1R_SST		(1 << 0)

/**@}*/

/** @defgroup hrtim_timc_rstc1r RSTC1R Timerx Output1 Reset Register
@{*/

/** HRTIM_TIMC_RSTC1R_UPDATE UPDATE **/
#define HRTIM_TIMC_RSTC1R_UPDATE		(1 << 31)
/** HRTIM_TIMC_RSTC1R_EXTEVNT10 EXTEVNT10 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT10		(1 << 30)
/** HRTIM_TIMC_RSTC1R_EXTEVNT9 EXTEVNT9 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT9		(1 << 29)
/** HRTIM_TIMC_RSTC1R_EXTEVNT8 EXTEVNT8 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT8		(1 << 28)
/** HRTIM_TIMC_RSTC1R_EXTEVNT7 EXTEVNT7 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT7		(1 << 27)
/** HRTIM_TIMC_RSTC1R_EXTEVNT6 EXTEVNT6 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT6		(1 << 26)
/** HRTIM_TIMC_RSTC1R_EXTEVNT5 EXTEVNT5 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT5		(1 << 25)
/** HRTIM_TIMC_RSTC1R_EXTEVNT4 EXTEVNT4 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT4		(1 << 24)
/** HRTIM_TIMC_RSTC1R_EXTEVNT3 EXTEVNT3 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT3		(1 << 23)
/** HRTIM_TIMC_RSTC1R_EXTEVNT2 EXTEVNT2 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT2		(1 << 22)
/** HRTIM_TIMC_RSTC1R_EXTEVNT1 EXTEVNT1 **/
#define HRTIM_TIMC_RSTC1R_EXTEVNT1		(1 << 21)
/** HRTIM_TIMC_RSTC1R_TIMEVNT9 TIMEVNT9 **/
#define HRTIM_TIMC_RSTC1R_TIMEVNT9		(1 << 20)
/** HRTIM_TIMC_RSTC1R_TIMEVNT8 TIMEVNT8 **/
#define HRTIM_TIMC_RSTC1R_TIMEVNT8		(1 << 19)
/** HRTIM_TIMC_RSTC1R_TIMEVNT7 TIMEVNT7 **/
#define HRTIM_TIMC_RSTC1R_TIMEVNT7		(1 << 18)
/** HRTIM_TIMC_RSTC1R_TIMEVNT6 TIMEVNT6 **/
#define HRTIM_TIMC_RSTC1R_TIMEVNT6		(1 << 17)
/** HRTIM_TIMC_RSTC1R_TIMEVNT5 TIMEVNT5 **/
#define HRTIM_TIMC_RSTC1R_TIMEVNT5		(1 << 16)
/** HRTIM_TIMC_RSTC1R_TIMEVNT4 TIMEVNT4 **/
#define HRTIM_TIMC_RSTC1R_TIMEVNT4		(1 << 15)
/** HRTIM_TIMC_RSTC1R_TIMEVNT3 TIMEVNT3 **/
#define HRTIM_TIMC_RSTC1R_TIMEVNT3		(1 << 14)
/** HRTIM_TIMC_RSTC1R_TIMEVNT2 TIMEVNT2 **/
#define HRTIM_TIMC_RSTC1R_TIMEVNT2		(1 << 13)
/** HRTIM_TIMC_RSTC1R_TIMEVNT1 TIMEVNT1 **/
#define HRTIM_TIMC_RSTC1R_TIMEVNT1		(1 << 12)
/** HRTIM_TIMC_RSTC1R_MSTCMP4 MSTCMP4 **/
#define HRTIM_TIMC_RSTC1R_MSTCMP4		(1 << 11)
/** HRTIM_TIMC_RSTC1R_MSTCMP3 MSTCMP3 **/
#define HRTIM_TIMC_RSTC1R_MSTCMP3		(1 << 10)
/** HRTIM_TIMC_RSTC1R_MSTCMP2 MSTCMP2 **/
#define HRTIM_TIMC_RSTC1R_MSTCMP2		(1 << 9)
/** HRTIM_TIMC_RSTC1R_MSTCMP1 MSTCMP1 **/
#define HRTIM_TIMC_RSTC1R_MSTCMP1		(1 << 8)
/** HRTIM_TIMC_RSTC1R_MSTPER MSTPER **/
#define HRTIM_TIMC_RSTC1R_MSTPER		(1 << 7)
/** HRTIM_TIMC_RSTC1R_CMP4 CMP4 **/
#define HRTIM_TIMC_RSTC1R_CMP4		(1 << 6)
/** HRTIM_TIMC_RSTC1R_CMP3 CMP3 **/
#define HRTIM_TIMC_RSTC1R_CMP3		(1 << 5)
/** HRTIM_TIMC_RSTC1R_CMP2 CMP2 **/
#define HRTIM_TIMC_RSTC1R_CMP2		(1 << 4)
/** HRTIM_TIMC_RSTC1R_CMP1 CMP1 **/
#define HRTIM_TIMC_RSTC1R_CMP1		(1 << 3)
/** HRTIM_TIMC_RSTC1R_PER PER **/
#define HRTIM_TIMC_RSTC1R_PER		(1 << 2)
/** HRTIM_TIMC_RSTC1R_RESYNC RESYNC **/
#define HRTIM_TIMC_RSTC1R_RESYNC		(1 << 1)
/** HRTIM_TIMC_RSTC1R_SRT SRT **/
#define HRTIM_TIMC_RSTC1R_SRT		(1 << 0)

/**@}*/

